rjsachse/ESP32-OnvifServer/onvif_service.cpp
#include "ESP32-OnvifServer.h"
//#include "lwip/apps/sntp.h" // Include SNTP header
#include "esp_sntp.h"
#include "service_headers.h"
#include "discovery_service.h"
#include "device_service.h"
#include "media_service.h"
#include "media2_service.h"
#include "events_service.h"
#include "imaging_service.h"
#include "ptz_service.h"

// const char* ONVIFServer::getResolutions() {
//   sensor_t *s = esp_camera_sensor_get();
//   if (!s) {
//     LOG_ERR("Camera sensor not detected");
//     return nullptr;
//   }
//   std::vector<Resolution> resolutions = getCameraResolutions(static_cast<camera_pid_t>(s->id.PID));

//   static char resolutionsXml[2560] = "";
//   char resolutionEntry[110];

//   resolutionsXml[0] = '\0'; // Clear the string

//   for (const auto& res : resolutions) {
//     snprintf(resolutionEntry, sizeof(resolutionEntry), 
//       "<tt:ResolutionsAvailable>"
//       "<tt:Width>%d</tt:Width>"
//       "<tt:Height>%d</tt:Height>"
//       "</tt:ResolutionsAvailable>", 
//       res.width, res.height);
//     strncat(resolutionsXml, resolutionEntry, sizeof(resolutionsXml) - strlen(resolutionsXml) - 1);
//   }
//   return resolutionsXml;
// }

const char* ONVIFServer::getResolutions() {
  sensor_t *s = esp_camera_sensor_get();
  if (!s) {
      LOG_ERR("Camera sensor not detected");
      return nullptr;
  }

  // Get the sensor information
  camera_sensor_info_t* info = esp_camera_sensor_get_info(&s->id);
  if (!info) {
      LOG_ERR("Failed to get sensor information");
      return nullptr;
  }

  // Get the resolutions
  std::vector<resolution_info_t> resolutions;
  framesize_t max_size = info->max_size;
  for (int fs = 0; fs <= max_size; ++fs) {
      resolutions.push_back(resolution[fs]);
  }

  // Generate XML string
  static char resolutionsXml[2560] = "";
  char resolutionEntry[110];

  resolutionsXml[0] = '\0'; // Clear the string

  for (const auto& res : resolutions) {
      snprintf(resolutionEntry, sizeof(resolutionEntry), 
          "<tt:ResolutionsAvailable>"
          "<tt:Width>%d</tt:Width>"
          "<tt:Height>%d</tt:Height>"
          "</tt:ResolutionsAvailable>", 
          res.width, res.height);
      strncat(resolutionsXml, resolutionEntry, sizeof(resolutionsXml) - strlen(resolutionsXml) - 1);
  }
  LOG_INF("XML: %s", resolutionsXml);
  return resolutionsXml;
}

bool setCameraFrameSize(int width, int height) {
  // Get sensor information
  sensor_t* s = esp_camera_sensor_get();
  if (!s) {
    LOG_ERR("Camera sensor not detected");
    return false;
  }

  camera_sensor_info_t* info = esp_camera_sensor_get_info(&s->id);
  if (!info) {
    LOG_ERR("Failed to get sensor information");
    return false;
  }

  // Find matching framesize_t
  framesize_t frameSize = FRAMESIZE_INVALID;
  for (int fs = 0; fs <= info->max_size; ++fs) {
    if (resolution[fs].width == width && resolution[fs].height == height) {
      frameSize = (framesize_t)fs;
      LOG_INF("Matched framesize: %dx%d", width, height);
      break;
    }
  }

  if (frameSize == FRAMESIZE_INVALID) {
    LOG_ERR("No matching framesize for resolution %dx%d", width, height);
    return false;
  }

  // Set frame size
  if (s->set_framesize(s, frameSize) != 0) {
    LOG_ERR("Failed to set framesize: %dx%d", width, height);
    return false;
  }

  LOG_INF("Camera frame size set to %dx%d", width, height);
  return true;
}

#include <esp_camera.h>

bool getResolution(uint16_t* width, uint16_t* height) {
  // Get sensor information
  sensor_t* s = esp_camera_sensor_get();
  if (!s) {
    LOG_ERR("Camera sensor not detected");
    return false;
  }
  // Get the sensor information
  camera_sensor_info_t* info = esp_camera_sensor_get_info(&s->id);
  if (!info) {
      LOG_ERR("Failed to get sensor information");
      return false;
  }

  // Get current framesize and resolution
  framesize_t frameSize = s->status.framesize;
  if (frameSize >= FRAMESIZE_INVALID || frameSize > info->max_size) {
    LOG_ERR("Invalid framesize: %d", frameSize);
    return false;
  }

  *width = resolution[frameSize].width;
  *height = resolution[frameSize].height;
  return true;
}

void ONVIFServer::extractMessageID(const char* packetData, char* messageID, size_t messageIDSize) {
  const char* startTag = "MessageID";
  const char* startPtr = strstr(packetData, startTag);
  if (!startPtr) {
    LOG_ERR("MessageID tag not found");
    messageID[0] = '\0';
    return;
  }
  startPtr = strchr(startPtr, '>') + 1;
  while (*startPtr == ' ' || *startPtr == '\n' || *startPtr == '\r') {
    startPtr++;
  }
  const char* endPtr = strstr(startPtr, "</");
  if (!endPtr) {
    LOG_ERR("MessageID end tag not found");
    messageID[0] = '\0';
    return;
  }

  // Check for prefixes and remove them from startPtr
  const char urnPrefix[] = "urn:";
  const char uuidPrefix[] = "uuid:";
  
  if (strncmp(startPtr, urnPrefix, strlen(urnPrefix)) == 0) {
    startPtr += strlen(urnPrefix);
  }
  
  if (strncmp(startPtr, uuidPrefix, strlen(uuidPrefix)) == 0) {
    startPtr += strlen(uuidPrefix);
  }
  
  size_t len = endPtr - startPtr;
  if (len >= messageIDSize) {
    LOG_ERR("MessageID is too long: %.*s", (int)len, startPtr);
    messageID[0] = '\0';
    return;
  }
  
  // Copy the cleaned message ID into the buffer
  strncpy(messageID, startPtr, len);
  messageID[len] = '\0';
}



void ONVIFServer::generateUUID(char* uuid, size_t uuidSize) {
  snprintf(uuid, uuidSize, "%08lx-%04lx-%04lx-%04lx-%012llx",
           (unsigned long)esp_random(), esp_random() & 0xFFFF,
           (esp_random() & 0x0FFF) | 0x4000,
           (esp_random() & 0x3FFF) | 0x8000,
           ((unsigned long long)esp_random() << 32) | esp_random());
}

void ONVIFServer::generateDeviceUUID(char* uuid, size_t uuidSize) {
  uint32_t chipId = ESP.getEfuseMac(); // Get the chip ID
  snprintf(uuid, uuidSize, "%08lx-%04lx-%04lx-%04lx-%012lx",
           (unsigned long)((chipId >> 16) & 0xFFFF),
           (unsigned long)(chipId & 0xFFFF),
           (unsigned long)((chipId >> 16) & 0xFFFF),
           (unsigned long)(chipId & 0xFFFF),
           (unsigned long)(chipId));
}

char* skipNamespace(const char* tag) {
    //LOG_INF("[ONVIF] Skipping namespace for tag: %s", tag);

    const char* colon = strchr(tag, ':');
    const char* space = strchr(tag, ' ');
    const char* slash = strchr(tag, '/');

    // Determine the nearest invalid character after the colon
    const char* boundary = tag + strlen(tag); // Default to the end of the string
    if (space && space < boundary) {
        boundary = space;
    }
    if (slash && slash < boundary) {
        boundary = slash;
    }

