rjsachse/ESP32-OnvifServer/onvif_service.cpp
    // Check if the colon is valid (i.e., before the boundary)
    if (colon && colon < boundary) {
        //LOG_INF("[ONVIF] Namespace found, skipping to: %s", colon + 1);
        return (char*)(colon + 1); // Skip past the colon
    }

    //LOG_INF("[ONVIF] No namespace found, using tag: %s", tag);
    return (char*)tag; // No namespace, return the original tag
}



char* findBodyStart(const char* requestBody) {
  //LOG_INF("Finding <Body> tag in request body.");

  char* body_start = strstr((char*)requestBody, ":Body");
  if (body_start) {
    body_start = strchr(body_start, '>'); // Find '>'
    if (body_start) {
      //LOG_INF("Found <Body> tag, moving to content at: %s", body_start + 1);
      return body_start + 1; // Move past '>'
    }
  }
  
  //LOG_INF("No <Body> tag found.");
  return NULL; // Body tag not found
}

char* extractAction(char* body_start) {
  //LOG_INF("[ONVIF] Extracting action from body content: %s", body_start);

  // Locate the opening of the action tag
  char* action_start = strstr(body_start, "<");
  if (action_start) {
    action_start++; // Move past '<'
    //LOG_INF("[ONVIF] Found action start: %s", action_start);

    // Locate the closing angle bracket ('>') to isolate just the main tag
    char* tag_end = strchr(action_start, '>');
    if (tag_end) {
      *tag_end = '\0'; // Temporarily null-terminate the tag for processing
    } else {
      //LOG_INF("[ONVIF] No closing bracket found for action tag.");
      return NULL;
    }

    // Skip namespace prefix, if present
    action_start = skipNamespace(action_start);

    if (tag_end) {
      *tag_end = '>'; // Restore the original string after processing
    }

    // Ensure the tag ends correctly (no nested content included)
    char* action_end = strpbrk(action_start, " />"); // Stop at space, '/', or end
    if (action_end) {
      size_t action_len = action_end - action_start;
      char* action = (char*)malloc(action_len + 1);
      if (action) {
        strncpy(action, action_start, action_len);
        action[action_len] = '\0'; // Null-terminate the action name
        //LOG_INF("[ONVIF] Successfully extracted action: %s", action);
        return action;
      } else {
        LOG_INF("[ONVIF] Memory allocation failed for action.");
      }
    } else {
      LOG_INF("[ONVIF] No valid end of action tag found.");
    }
  } else {
    LOG_INF("[ONVIF] No action tag found in body.");
  }

  return NULL; // Action tag not found or invalid
}




char* ONVIFServer::getAction(const char* requestBody) {
  //LOG_INF("Starting action extraction for request body.");

  // Step 1: Find the start of the <Body> section
  char* body_start = findBodyStart(requestBody);
  if (!body_start) {
    LOG_INF("Failed to find <Body> section.");
    return NULL; // No <Body> tag found
  }

  // Step 2: Extract the action name from the <Body> section
  char* action = extractAction(body_start);
  if (!action) {
    LOG_INF("Failed to extract action from body content.");
  }

  return action;
}


// char* ONVIFServer::getAction(const char* requestBody) {
//   char* action = NULL;

//   // Locate the <*:Body> tag
//   char* body_start = strstr((char*)requestBody, ":Body");
//   if (body_start) {
//     body_start = strchr(body_start, '>'); // Move to the end of <*:Body>
//     if (body_start) {
//       body_start++; // Move past '>'

//       // Locate the opening tag of the action
//       char* action_start = strstr(body_start, "<");
//       if (action_start) {
//         action_start++; // Move past '<'

//         // Skip namespace prefix (e.g., "tds:")
//         char* colon = strchr(action_start, ':');
//         if (colon && colon < strchr(action_start, ' ') && colon < strchr(action_start, '>')) {
//           action_start = colon + 1; // Move past the colon
//         }

//         // Find the end of the action tag name
//         char* action_end = strpbrk(action_start, " />"); // Stop at space, '/', or '>'
//         if (action_end) {
//           size_t action_len = action_end - action_start;
//           action = (char*)malloc(action_len + 1);
//           if (action) {
//             strncpy(action, action_start, action_len);
//             action[action_len] = '\0'; // Null-terminate the action string
//           }
//         }
//       }
//     }
//   }

//   return action;
// }

void ONVIFServer::populateOnvifResponse(const char* mainHeader, const char* templateStr, ...) {
  if (onvifBuffer == NULL) {
    LOG_ERR("ONVIF Buffer not allocated! Unable to create response, starting Onvif.");
    return;
  }

  snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "%s", mainHeader);
  va_list args;
  va_start(args, templateStr);
  vsnprintf((char*)onvifBuffer + strlen((char*)onvifBuffer), ONVIF_BUFFER_SIZE - strlen((char*)onvifBuffer), templateStr, args);
  va_end(args);

  strncat((char*)onvifBuffer, footer, ONVIF_BUFFER_SIZE - strlen((char*)onvifBuffer) - 1);
}

char* ONVIFServer::populateSection(const char* format, ...) {
  char* buffer = (char*)malloc(ONVIF_PARTS_BUFFER_SIZE);
  if (!buffer) {
    LOG_ERR("Failed to allocate memory for section buffer");
    return NULL;
  }
  va_list args;
  va_start(args, format);
  vsnprintf(buffer, ONVIF_PARTS_BUFFER_SIZE, format, args);
  va_end(args);
  allocatedBuffers.push_back(buffer); // Add buffer to the list
  return buffer;
}


void ONVIFServer::buildOnvifResponse(const std::vector<const char*>& parts) {
  if (onvifBuffer == NULL) {
    LOG_ERR("ONVIF Buffer not allocated! Unable to create response.");
    return;
  }

  // Initialize onvifBuffer with the first part
  snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "%s", parts[0]);

  for (size_t i = 1; i < parts.size(); ++i) {
    if (parts[i] != NULL) {
      strncat((char*)onvifBuffer, parts[i], ONVIF_BUFFER_SIZE - strlen((char*)onvifBuffer) - 1);
    }
  }

  strncat((char*)onvifBuffer, footer, ONVIF_BUFFER_SIZE - strlen((char*)onvifBuffer) - 1);

  // Free all allocated buffers
  for (char* buffer : allocatedBuffers) {
    free(buffer);
  }
  allocatedBuffers.clear(); // Clear the list
}

