rjsachse/ESP32-OnvifServer/onvif_service.cpp
template<typename... section>
void ONVIFServer::buildOnvifResponse(const char* mainHeader, section... args) {
  std::vector<const char*> parts = { mainHeader, args... };
  buildOnvifResponse(parts);
}

void ONVIFServer::sendMatch(const char* messageID, const char* relatesToID, const char* action) {
  const char* fullAction;
  if (strcmp(action, "probe") == 0) {
    fullAction = "http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches";
  } else if (strcmp(action, "resolve") == 0) {
    fullAction = "http://schemas.xmlsoap.org/ws/2005/04/discovery/ResolveMatches";
  } else {
    LOG_ERR("Wrong action passed!");
    return;
  }
  buildOnvifResponse(discoverNS, populateSection(onvifMatch, messageID, relatesToID, fullAction,
                        (strcmp(action, "probe") == 0 ? "ProbeMatches" : "ResolveMatches"),
                        (strcmp(action, "probe") == 0 ? "ProbeMatch" : "ResolveMatch"),
                        deviceUUID, location, name, hardware, ipAddress,
                        (strcmp(action, "probe") == 0 ? "ProbeMatch" : "ResolveMatch"),
                        (strcmp(action, "probe") == 0 ? "ProbeMatches" : "ResolveMatches"))
                        );
}

void ONVIFServer::sendMessage(const char* messageType) {
  char messageID[37];
  generateUUID(messageID, sizeof(messageID));
  buildOnvifResponse(discoverNS, populateSection(messageType, messageID, deviceUUID, location, name, hardware, ipAddress));
  //populateOnvifResponse(discoverNS, messageType, messageID, deviceUUID, location, name, hardware, ipAddress);
  sendto(sock, (char*)onvifBuffer, strlen((char*)onvifBuffer), 0, (const struct sockaddr*)&addr, sizeof(addr));
}

// bool extractValue(const char* xml, const char* tag, int& value) {
//   char openTag[128];
//   char closeTag[128];

//   // Construct the full opening and closing tags
//   snprintf(openTag, sizeof(openTag), "<%s", tag);
//   snprintf(closeTag, sizeof(closeTag), "</%s>", tag);

//   const char* start = strstr(xml, openTag);
//   if (start) {
//     // Move the pointer past the opening tag and any attributes
//     start = strchr(start, '>') + 1;
//     const char* end = strstr(start, closeTag);
//     if (end) {
//       char buffer[16];
//       strncpy(buffer, start, end - start);
//       buffer[end - start] = '\0';
//       value = atoi(buffer);
//       return true;
//     }
//   }
//   return false;
// }

bool extractValue(const char* xml, const char* tag, int& value) {
  char openTag[128];
  char closeTag[128];
  char nsOpenTag[128];

  // Construct the tag patterns to search for: <tag>, <tt:tag>, or <:tag>
  snprintf(openTag, sizeof(openTag), "<%s", tag);
  snprintf(closeTag, sizeof(closeTag), "</%s>", tag);
  snprintf(nsOpenTag, sizeof(nsOpenTag), "<tt:%s>", tag);

  // Search for either <tag> or <tt:tag>
  const char* start = strstr(xml, openTag);
  if (!start) {
    start = strstr(xml, nsOpenTag);
    if (!start) {
      // Try searching for tag after a colon
      char colonTag[128];
      snprintf(colonTag, sizeof(colonTag), ":%s>", tag);
      start = strstr(xml, colonTag);
      if (start) {
        start -= 3; // Move back to include "<tt" for consistency
      }
    }
  }

  if (start) {
    // Move past the opening tag
    start = strchr(start, '>') + 1;
    if (!start) {
      LOG_ERR("Invalid tag format for %s", tag);
      return false;
    }

    // Find the closing tag (</tag> or </tt:tag>)
    const char* end = strstr(start, closeTag);
    if (!end) {
      char nsCloseTag[128];
      snprintf(nsCloseTag, sizeof(nsCloseTag), "</tt:%s>", tag);
      end = strstr(start, nsCloseTag);
    }

    if (end) {
      char buffer[32];
      size_t len = end - start;
      if (len >= sizeof(buffer)) {
        LOG_ERR("Value too long for tag %s", tag);
        return false;
      }
      strncpy(buffer, start, len);
      buffer[len] = '\0';

      // Remove leading/trailing whitespace
      char* trimmed = buffer;
      while (*trimmed == ' ' || *trimmed == '\n' || *trimmed == '\t') trimmed++;
      char* endptr = trimmed + strlen(trimmed) - 1;
      while (endptr > trimmed && (*endptr == ' ' || *endptr == '\n' || *endptr == '\t')) {
        *endptr = '\0';
        endptr--;
      }

      // Parse as float and round to nearest integer
      float floatValue = atof(trimmed);
      value = (int)roundf(floatValue);
      LOG_INF("Extracted %s: %d (raw: %s)", tag, value, trimmed);
      return true;
    } else {
      LOG_ERR("Closing tag for %s not found", tag);
    }
  } else {
    LOG_ERR("Opening tag for %s not found", tag);
  }
  return false;
}

bool extractFloatValue(const char* xml, const char* tag, int& value) {
  char openTag[128];
  char closeTag[128];

  // Construct the full opening and closing tags with namespace
  snprintf(openTag, sizeof(openTag), "<%s>", tag);
  snprintf(closeTag, sizeof(closeTag), "</%s>", tag);

  const char* start = strstr(xml, openTag);
  if (start) {
    // Move the pointer past the opening tag
    start += strlen(openTag);
    const char* end = strstr(start, closeTag);
    if (end) {
      char buffer[32]; // Increased buffer size for safety
      size_t len = end - start;
      if (len >= sizeof(buffer)) {
        LOG_ERR("Value too long for tag %s", tag);
        return false;
      }
      strncpy(buffer, start, len);
      buffer[len] = '\0';

      // Remove leading/trailing whitespace
      char* trimmed = buffer;
      while (*trimmed == ' ' || *trimmed == '\n' || *trimmed == '\t') trimmed++;
      char* endptr = trimmed + strlen(trimmed) - 1;
      while (endptr > trimmed && (*endptr == ' ' || *endptr == '\n' || *endptr == '\t')) {
        *endptr = '\0';
        endptr--;
      }

      // Parse as float and round to nearest integer
      float floatValue = atof(trimmed);
      value = (int)roundf(floatValue);
      LOG_INF("Extracted %s: %d (raw: %s)", tag, value, trimmed);
      return true;
    } else {
      LOG_ERR("Closing tag %s not found", closeTag);
    }
  } else {
    LOG_ERR("Opening tag %s not found", openTag);
  }
  return false;
}

bool extractStringValue(const char* xml, const char* tag, char* value, size_t valueSize) {
  const char* start = strstr(xml, tag);
  if (start) {
    start = strchr(start, '>') + 1;
    const char* end = strchr(start, '<');
    if (end) {
      size_t len = end - start;
      if (len >= valueSize) {
        LOG_ERR("Value is too long: %.*s", (int)len, start);
        return false;
      }
      strncpy(value, start, len);
      value[len] = '\0';
      return true;
    }
  }
  return false;
}

void ONVIFServer::parseSystemDateAndTime(const char* requestBody) {
  char dateTimeType[16], daylightSavings[6], timeZone[64];
  int hour, minute, second, year, month, day;

  // Extract and log DateTimeType
  if (!extractStringValue(requestBody, "DateTimeType", dateTimeType, sizeof(dateTimeType))) {
    LOG_ERR("Failed to extract DateTimeType");
    return;
  }
  LOG_INF("Extracted DateTimeType: %s", dateTimeType);

  // Extract and log DaylightSavings
  if (!extractStringValue(requestBody, "DaylightSavings", daylightSavings, sizeof(daylightSavings))) {
    LOG_ERR("Failed to extract DaylightSavings");
    return;
  }
  LOG_INF("Extracted DaylightSavings: %s", daylightSavings);

  // Extract and log TimeZone
  if (!extractStringValue(requestBody, "TZ", timeZone, sizeof(timeZone))) {
    LOG_ERR("Failed to extract TimeZone");
    return;
  }
  LOG_INF("Extracted TimeZone: %s", timeZone);

  // Extract and log time values
  if (!extractValue(requestBody, "Hour", hour) ||
      !extractValue(requestBody, "Minute", minute) ||
      !extractValue(requestBody, "Second", second) ||
      !extractValue(requestBody, "Year", year) ||
      !extractValue(requestBody, "Month", month) ||
      !extractValue(requestBody, "Day", day)) {
    LOG_ERR("Failed to extract date/time values");
    return;
  }
  LOG_INF("Extracted Time: %04d-%02d-%02d %02d:%02d:%02d", year, month, day, hour, minute, second);

  // Apply the extracted settings
  struct tm timeinfo;
  timeinfo.tm_year = year - 1900;
  timeinfo.tm_mon = month - 1;
  timeinfo.tm_mday = day;
  timeinfo.tm_hour = hour;
  timeinfo.tm_min = minute;
  timeinfo.tm_sec = second;

  // Log timeinfo struct values
  LOG_INF("tm structure - Year: %d, Month: %d, Day: %d, Hour: %d, Minute: %d, Second: %d",
          timeinfo.tm_year + 1900, timeinfo.tm_mon + 1, timeinfo.tm_mday, timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);

