rjsachse/ESP32-OnvifServer/onvif_service.cpp
    const char* dateTimeType = (sntp_get_sync_status() == SNTP_SYNC_STATUS_COMPLETED) ? "NTP" : "Manual";
    const char* daylightSavings = timeinfo.tm_isdst > 0 ? "true" : "false";

    buildOnvifResponse(maxHeader, populateSection(getSystemDateAndTime,
                          dateTimeType, daylightSavings, timezone,
                          timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec,
                          timeinfo.tm_year + 1900, timeinfo.tm_mon + 1, timeinfo.tm_mday));
  } else if (strstr(action, "SetSystemDateAndTime")) {
    parseSystemDateAndTime(requestBody);
    buildOnvifResponse(maxHeader, setSystemDateAndTime);
  } else if (strstr(action, "SetNetworkProtocols")) {
    parseNetworkProtocols(requestBody);
    buildOnvifResponse(maxHeader, setNetworkProtocols);
  } else if (strstr(action, "GetEndpointReference")) {
    buildOnvifResponse(maxHeader, populateSection(getEndpointReference, deviceUUID));
  } else {
    snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "UNKNOWN");
  }
}

void ONVIFServer::handleMediaService(const char* action, const char* requestBody) {
  if (strcmp(action, "GetProfile") == 0) {
    populateOnvifResponse(maxHeader, getProfiles, "Profile", "Profile", "Profile", "Profile");
  } else if (strcmp(action, "GetProfiles") == 0) {
    populateOnvifResponse(maxHeader, getProfiles, "Profiles", "Profiles", "Profiles", "Profiles");
  } else if (strstr(action, "GetStreamUri")) {
    populateOnvifResponse(maxHeader, getStreamUri, ipAddress);
  } else if (strstr(action, "GetSnapshotUri")) {
    populateOnvifResponse(maxHeader, getSnapshotUri, ipAddress);
  } else if (strstr(action, "GetVideoSources")) {
    populateOnvifResponse(maxHeader, getVideoSources);
  } else if (strstr(action, "GetVideoSourceConfiguration")) {
    populateOnvifResponse(maxHeader, getVideoSourceConfiguration);
  } else if (strstr(action, "GetVideoEncoderConfigurationOptions")) {
    buildOnvifResponse(maxHeader, populateSection(getVideoEncoderConfigurationOptions, getResolutions()));
  } else if (strstr(action, "GetAudioDecoderConfigurations")) {
    populateOnvifResponse(maxHeader, getAudioDecoderConfigurations);
  } else if (strstr(action, "GetAudioSources")) {
    populateOnvifResponse(maxHeader, getAudioSources);
  } else if (strstr(action, "GetAudioOutputConfiguration")) {
    populateOnvifResponse(maxHeader, getAudioOutputConfiguration);
  } else if (strstr(action, "GetAudioOutputConfigurationOptions")) {
    populateOnvifResponse(maxHeader, getAudioOutputConfigurationOptions);
  } else if (strstr(action, "GetAudioOutputConfigurations")) {
    populateOnvifResponse(maxHeader, getAudioOutputConfigurations);
  } else if (strstr(action, "SetVideoEncoderConfiguration")) {
    parseAndSetVideoEncoderConfiguration(requestBody);
    populateOnvifResponse(maxHeader, setVideoEncoderConfiguration);
  } else {
    snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "UNKNOWN");
  }
}

void ONVIFServer::handleMedia2Service(const char* action, const char* requestBody) {
  if (strcmp(action, "GetProfiles") == 0) {
    populateOnvifResponse(maxHeader, getProfilesMedia2);
  } else if (strstr(action, "GetStreamUri")) {
    populateOnvifResponse(maxHeader, getStreamUri2, ipAddress);
  } else if (strstr(action, "GetSnapshotUri")) {
    populateOnvifResponse(maxHeader, getSnapshotUri2, ipAddress);
  } else if (strstr(action, "GetVideoSourceConfigurations")) {
    uint16_t width, height;
    if (getResolution(&width, &height)) {
      populateOnvifResponse(maxHeader, getVideoSourceConfigurations2, width, height);
    }
  } else if (strstr(action, "GetVideoEncoderConfigurations")) {
    uint16_t width, height;
    sensor_t* s = esp_camera_sensor_get();
    if (!s) {
      LOG_ERR("Failed to get camera sensor");
      return;
    }

    int quality = s->status.quality;
    if (getResolution(&width, &height)) {
      populateOnvifResponse(maxHeader, getVideoEncoderConfigurations2, width, height, quality);
    }
  } else if (strstr(action, "GetVideoEncoderConfigurationOptions")) {
    buildOnvifResponse(maxHeader, populateSection(getVideoEncoderConfigurationOptions2, getResolutions()));
  } else if (strstr(action, "GetAudioDecoderConfigurations")) {
    populateOnvifResponse(maxHeader, getAudioDecoderConfigurations2);
  } else if (strstr(action, "GetAudioEncoderConfigurations")) {
    populateOnvifResponse(maxHeader, getAudioEncoderConfigurations2);
  } else if (strstr(action, "GetAudioDecoderConfigurationOptions")) {
    populateOnvifResponse(maxHeader, getAudioDecoderConfigurationOptions2);
  } else if (strstr(action, "GetAudioEncoderConfigurationOptions")) {
    populateOnvifResponse(maxHeader, getAudioEncoderConfigurationOptions2);
  } else if (strstr(action, "GetAudioOutputConfigurations")) {
    populateOnvifResponse(maxHeader, getAudioOutputConfigurations2);
  } else if (strstr(action, "GetAudioOutputConfigurationOptions")) {
    populateOnvifResponse(maxHeader, getAudioOutputConfigurationOptions2);
  } else if (strstr(action, "GetAudioInputConfigurations")) {
    populateOnvifResponse(maxHeader, getAudioInputConfigurations2);
  } else if (strstr(action, "SetAudioInputConfiguration")) {
    // Implement logic to set audio input configuration based on requestBody
    populateOnvifResponse(maxHeader, setAudioInputConfiguration2);
  } else if (strstr(action, "GetAudioSourceConfigurations")) {
    populateOnvifResponse(maxHeader, getAudioSourceConfigurations2);
  } else if (strstr(action, "SetVideoEncoderConfiguration")) {
    parseAndSetVideoEncoderConfiguration(requestBody);
    populateOnvifResponse(maxHeader, setVideoEncoderConfiguration);
  } else {
    snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "UNKNOWN");
  }
}

void ONVIFServer::handleImagingService(const char* action, const char* requestBody) {
  if (strstr(action, "GetImagingSettings")) {
    sensor_t* s = esp_camera_sensor_get();
    if (!s) {
      LOG_ERR("Failed to get camera sensor");
      return;
    }

    int brightness = s->status.brightness;
    int contrast = s->status.contrast;
    int colorSaturation = s->status.saturation;
    int sharpness = s->status.sharpness;
    const char* exposureMode = s->status.aec ? "AUTO" : "MANUAL";
    int minExposureTime = s->status.aec2;
    int maxExposureTime = s->status.aec_value;
    int gain = s->status.agc_gain;
    const char* whiteBalanceMode = s->status.awb ? "AUTO" : "MANUAL";

    populateOnvifResponse(maxHeader, getImagingSettings,
                          brightness, contrast, colorSaturation, sharpness,
                          exposureMode, minExposureTime, maxExposureTime, gain,
                          whiteBalanceMode);
  } else if (strstr(action, "GetOptions")) {
    populateOnvifResponse(maxHeader, getImagingOptions);
  } else if (strstr(action, "GetMoveOptions")) {
    populateOnvifResponse(maxHeader, getMoveOptions);
  } else if (strstr(action, "SetImagingSettings")) {
    if (requestBody) parseAndApplySettings(requestBody);
    populateOnvifResponse(maxHeader, setImagingSettings);
  } else {
    snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "UNKNOWN");
  }
}

void ONVIFServer::handlePTZService(const char* action, const char* requestBody) {
  if (strstr(action, "GetNodes")) {
    populateOnvifResponse(ptzHeader, getNodes);
  } else if (strstr(action, "GetConfigurations")) {
    populateOnvifResponse(ptzHeader, getConfigurations);
  } else {
    snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "UNKNOWN");
  }
}

void ONVIFServer::handleEventService(const char* action, const char* requestBody) {
  char currentTime[32], terminationTime[32], utcTime[32];
  time_t now = time(NULL);
  struct tm timeinfo;
  gmtime_r(&now, &timeinfo);
  strftime(currentTime, sizeof(currentTime), "%Y-%m-%dT%H:%M:%SZ", &timeinfo);
  timeinfo.tm_min += 1;
  mktime(&timeinfo);
  strftime(terminationTime, sizeof(terminationTime), "%Y-%m-%dT%H:%M:%SZ", &timeinfo);
  strftime(utcTime, sizeof(utcTime), "%Y-%m-%dT%H:%M:%SZ", &timeinfo);

  char messageID[42];
  generateUUID(messageID, sizeof(messageID));

  if (strstr(action, "GetEventProperties")) {
    populateOnvifResponse(maxHeader, getEventProperties, messageID);
  } else if (strstr(action, "CreatePullPointSubscription")) {
    populateOnvifResponse(maxHeader, createPullPointSubscription, messageID, ipAddress, currentTime, terminationTime);
  } else if (strstr(action, "PullMessages")) {
    populateOnvifResponse(maxHeader, pullMessages, currentTime, terminationTime, utcTime, utcTime);
  } else if (strstr(action, "Unsubscribe")) {
    populateOnvifResponse(maxHeader, unsubscribe, messageID);
  } else if (strstr(action, "Renew")) {
    populateOnvifResponse(maxHeader, renewSubscription, messageID, terminationTime, currentTime);
  } else {
    snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "UNKNOWN");
  }
}

void ONVIFServer::onvifServiceResponse(const char* uri, const char* requestBody) {
  // Extract action from requestBody
  char* action = getAction(requestBody);

  // Safely log the action and URI
  if (action && uri) {
    LOG_INF("Onvif request: %s at URI: %s", action, uri);
  } else if (uri) {
    LOG_INF("Onvif request: [No Action] at URI: %s", uri);
  } else {
    LOG_INF("Onvif request: [No Action or URI]");
  }

  if (action) {
    if (strstr(uri, "/device_service")) {
      handleDeviceService(action, requestBody);
    } else if (strstr(uri, "/media_service")) {
      handleMediaService(action, requestBody);
    } else if (strstr(uri, "/media2_service")) {
      handleMedia2Service(action, requestBody);
    } else if (strstr(uri, "/image_service")) {
      handleImagingService(action, requestBody);
    } else if (strstr(uri, "/ptz_service")) {
      handlePTZService(action, requestBody);
    } else if (strstr(uri, "/event_service")) {
      handleEventService(action, requestBody);
    } else {
      snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "UNKNOWN");
    }
    free(action); // Free the allocated memory for action
  }
}

void ONVIFServer::process_packet(const char *packet_data, size_t len, const struct sockaddr_in *sender_addr, int sock) {
  if (onvifBuffer == NULL) {
    LOG_ERR("ONVIF Buffer not allocated!");
    return;
  }
  char messageID[42];
  char relatesToID[37];
  generateUUID(messageID, sizeof(messageID));
  extractMessageID(packet_data, relatesToID, sizeof(relatesToID));
  // Check for Probe
  if (strstr(packet_data, "Probe") != NULL) {
    sendMatch(messageID, relatesToID, "probe");
  }
  // Check for Resolve
  else if (strstr(packet_data, "Resolve") != NULL) {
    sendMatch(messageID, relatesToID, "resolve");
  }
  // Send response
  if (strlen((char*)onvifBuffer) <= 4096) { // have to check max size again was 1444
    sendto(sock, (char*)onvifBuffer, strlen((char*)onvifBuffer), 0, (struct sockaddr *)sender_addr, sizeof(*sender_addr));
  } else {
    LOG_ERR("UDP Failed to send response packet too large");
  }
}

void ONVIFServer::sendHelloWrapper(void* arg) {
  ONVIFServer* server = static_cast<ONVIFServer*>(arg);
  server->sendHello();
}

void ONVIFServer::sendHello() {
  sendMessage(onvifHello);
}
